# IFCParameter Template Export Property Setup To File Method

Source: https://www.revitapidocs.com/2026/4b193a70-936e-6caa-5317-c41e29ae0f3e.htm

---

| IFCParameter Template Export Property Setup To File Method |
| --- |

Exports mapping information of the provided property setup to a text file.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void ExportPropertySetupToFile(
	PropertySetupType propertySetupType,
	string fileName
)
```

```
Public Sub ExportPropertySetupToFile (
	propertySetupType As PropertySetupType,
	fileName As String
)
```

```
public:
void ExportPropertySetupToFile(
	PropertySetupType propertySetupType,
	String^ fileName
)
```

```
member ExportPropertySetupToFile :
        propertySetupType : PropertySetupType *
        fileName : string -> unit
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

fileName String
:   The full text file name.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| FileAccessException | Failed to access the text file. |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace